#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.nebula_react.github_repository.main: Refreshing state... [id=nebula-react]
module.CALONEBastien.data.github_user.main: Refreshing state...
module.black_hole.github_repository.main: Refreshing state... [id=black-hole]
module.DURANDRomain.data.github_user.main: Refreshing state...
module.BERNARDJeremy.data.github_user.main: Refreshing state...
module.RAMEAUBenoit.data.github_user.main: Refreshing state...
module.amp-jekyll.github_repository.main: Refreshing state... [id=amp-jekyll]
module.BERTRANDVincent.data.github_user.main: Refreshing state...
module.JACQUEMINArthur.data.github_user.main: Refreshing state...
module.AMARBenjamin.data.github_user.main: Refreshing state...
module.FERTDimitri.data.github_user.main: Refreshing state...
module.github.github_repository.main: Refreshing state... [id=github]
module.api-validator.github_repository.main: Refreshing state... [id=api-validator]
module.MOUTTEAnthony.data.github_user.main: Refreshing state...
module.HUCHONThibaud.data.github_user.main: Refreshing state...
module.COURBORenaud.data.github_user.main: Refreshing state...
module.LENGLETMartin.data.github_user.main: Refreshing state...
module.ALLIERAlexandre.data.github_user.main: Refreshing state...
module.KANIANoel.data.github_user.main: Refreshing state...
module.ELFARSAOUIKamal.data.github_user.main: Refreshing state...
module.GRAILLONRobin.data.github_user.main: Refreshing state...
module.LANAUGregory.data.github_user.main: Refreshing state...
module.PASQUETFabien.data.github_user.main: Refreshing state...
module.MAVILLAZRemi.data.github_user.main: Refreshing state...
module.SAILLARDDamien11.data.github_user.main: Refreshing state...
module.EINHORNStephane.data.github_user.main: Refreshing state...
module.PEAUDECERFMarion.data.github_user.main: Refreshing state...
module.DUNGKevin.data.github_user.main: Refreshing state...
module.WILSON.data.github_user.main: Refreshing state...
module.OGRENCarl.data.github_user.main: Refreshing state...
module.MINASYANMarie.data.github_user.main: Refreshing state...
module.VEBERArnaud.data.github_user.main: Refreshing state...
module.BESSOUDOSebastien.data.github_user.main: Refreshing state...
module.MIGEOTDEBARANFabrice.data.github_user.main: Refreshing state...
module.MOATIJacques.data.github_user.main: Refreshing state...
module.BRENOTPierre.data.github_user.main: Refreshing state...
module.JARDINETRemy.data.github_user.main: Refreshing state...
module.BOILLONYannick.data.github_user.main: Refreshing state...
module.GREVINNicolas.data.github_user.main: Refreshing state...
module.FRUITDimitri.data.github_user.main: Refreshing state...
module.SOLOMONEmmanuel.data.github_user.main: Refreshing state...
module.JOSEPHMarianne.data.github_user.main: Refreshing state...
module.BRUGIDOUThibaut.data.github_user.main: Refreshing state...
module.ANDREAlexandre.data.github_user.main: Refreshing state...
module.BERRYElsa.data.github_user.main: Refreshing state...
module.PEJOUTThomas.data.github_user.main: Refreshing state...
module.CLAVIERAnais.data.github_user.main: Refreshing state...
module.CHARRONMaeva.data.github_user.main: Refreshing state...
module.GORRONCharlesEric.data.github_user.main: Refreshing state...
module.core.github_team.main: Refreshing state... [id=540795]
module.NICOLAIEAlexandre.data.github_user.main: Refreshing state...
module.hq.github_team.main: Refreshing state... [id=2362575]
module.SURPierre.data.github_user.main: Refreshing state...
module.DELPEYROUXVictor.data.github_user.main: Refreshing state...
module.developers.github_team.main: Refreshing state... [id=642624]
module.CANALGuillem.data.github_user.main: Refreshing state...
module.FEIREISENBenjamin.data.github_user.main: Refreshing state...
module.THUONThierry.data.github_user.main: Refreshing state...
module.wheel-of-fortune.github_repository.main: Refreshing state... [id=wheel-of-fortune]
module.CADOUXMartin.data.github_user.main: Refreshing state...
module.jekyll-multiple-languages-plugin.github_repository.main: Refreshing state... [id=jekyll-multiple-languages-plugin]
module.LEROUGEPierre.data.github_user.main: Refreshing state...
module.CORDIERKevin.data.github_user.main: Refreshing state...
module.codelabs.github_repository.main: Refreshing state... [id=codelabs]
module.BETHMONTThomas.data.github_user.main: Refreshing state...
module.KONTOMARKOSSophie.data.github_user.main: Refreshing state...
module.blog_eleven-labs_com.github_repository.main: Refreshing state... [id=blog.eleven-labs.com]
module.DIOURIYounes.data.github_user.main: Refreshing state...
module.PIERLOTRomain.data.github_user.main: Refreshing state...
module.SAILLARDDamien.data.github_user.main: Refreshing state...
module.nebula_react.github_issue_label.main[0]: Refreshing state... [id=nebula-react:status/depend]
module.nebula_react.github_issue_label.main[6]: Refreshing state... [id=nebula-react:type/fix]
module.nebula_react.github_issue_label.main[4]: Refreshing state... [id=nebula-react:type/chore]
module.nebula_react.github_issue_label.main[7]: Refreshing state... [id=nebula-react:type/question]
module.nebula_react.github_issue_label.main[5]: Refreshing state... [id=nebula-react:type/feat]
module.nebula_react.github_issue_label.main[2]: Refreshing state... [id=nebula-react:status/reviewable]
module.nebula_react.github_issue_label.main[8]: Refreshing state... [id=nebula-react:type/refactor]
module.nebula_react.github_issue_label.main[9]: Refreshing state... [id=nebula-react:type/test]
module.nebula_react.github_issue_label.main[1]: Refreshing state... [id=nebula-react:status/mergeable]
module.nebula_react.github_issue_label.main[3]: Refreshing state... [id=nebula-react:status/wip]
module.black_hole.github_issue_label.main[6]: Refreshing state... [id=black-hole:type/fix]
module.black_hole.github_issue_label.main[0]: Refreshing state... [id=black-hole:status/depend]
module.black_hole.github_issue_label.main[2]: Refreshing state... [id=black-hole:status/reviewable]
module.black_hole.github_issue_label.main[9]: Refreshing state... [id=black-hole:type/test]
module.black_hole.github_issue_label.main[8]: Refreshing state... [id=black-hole:type/refactor]
module.black_hole.github_issue_label.main[4]: Refreshing state... [id=black-hole:type/chore]
module.black_hole.github_issue_label.main[5]: Refreshing state... [id=black-hole:type/feat]
module.black_hole.github_issue_label.main[1]: Refreshing state... [id=black-hole:status/mergeable]
module.black_hole.github_issue_label.main[7]: Refreshing state... [id=black-hole:type/question]
module.black_hole.github_issue_label.main[3]: Refreshing state... [id=black-hole:status/wip]
module.amp-jekyll.github_issue_label.main[4]: Refreshing state... [id=amp-jekyll:type/chore]
module.amp-jekyll.github_issue_label.main[1]: Refreshing state... [id=amp-jekyll:status/mergeable]
module.amp-jekyll.github_issue_label.main[7]: Refreshing state... [id=amp-jekyll:type/question]
module.amp-jekyll.github_issue_label.main[6]: Refreshing state... [id=amp-jekyll:type/fix]
module.amp-jekyll.github_issue_label.main[8]: Refreshing state... [id=amp-jekyll:type/refactor]
module.amp-jekyll.github_issue_label.main[2]: Refreshing state... [id=amp-jekyll:status/reviewable]
module.amp-jekyll.github_issue_label.main[3]: Refreshing state... [id=amp-jekyll:status/wip]
module.amp-jekyll.github_issue_label.main[9]: Refreshing state... [id=amp-jekyll:type/test]
module.amp-jekyll.github_issue_label.main[0]: Refreshing state... [id=amp-jekyll:status/depend]
module.amp-jekyll.github_issue_label.main[5]: Refreshing state... [id=amp-jekyll:type/feat]
module.github.github_branch_protection.main[0]: Refreshing state... [id=github:master]
module.github.github_issue_label.main[5]: Refreshing state... [id=github:type/feat]
module.github.github_issue_label.main[3]: Refreshing state... [id=github:status/wip]
module.github.github_issue_label.main[6]: Refreshing state... [id=github:type/fix]
module.github.github_issue_label.main[7]: Refreshing state... [id=github:type/question]
module.github.github_issue_label.main[9]: Refreshing state... [id=github:type/test]
module.github.github_issue_label.main[4]: Refreshing state... [id=github:type/chore]
module.github.github_issue_label.main[1]: Refreshing state... [id=github:status/mergeable]
module.github.github_issue_label.main[8]: Refreshing state... [id=github:type/refactor]
module.github.github_issue_label.main[0]: Refreshing state... [id=github:status/depend]
module.github.github_issue_label.main[2]: Refreshing state... [id=github:status/reviewable]
module.api-validator.github_issue_label.main[2]: Refreshing state... [id=api-validator:status/reviewable]
module.api-validator.github_issue_label.main[1]: Refreshing state... [id=api-validator:status/mergeable]
module.api-validator.github_issue_label.main[6]: Refreshing state... [id=api-validator:type/fix]
module.api-validator.github_issue_label.main[8]: Refreshing state... [id=api-validator:type/refactor]
module.api-validator.github_issue_label.main[7]: Refreshing state... [id=api-validator:type/question]
module.api-validator.github_issue_label.main[3]: Refreshing state... [id=api-validator:status/wip]
module.api-validator.github_issue_label.main[4]: Refreshing state... [id=api-validator:type/chore]
module.api-validator.github_issue_label.main[5]: Refreshing state... [id=api-validator:type/feat]
module.api-validator.github_issue_label.main[0]: Refreshing state... [id=api-validator:status/depend]
module.api-validator.github_issue_label.main[9]: Refreshing state... [id=api-validator:type/test]
module.api-validator.github_repository_webhook.main[0]: Refreshing state... [id=61952561]
module.api-validator.github_repository_webhook.main[1]: Refreshing state... [id=61898918]
module.api-validator.github_repository_webhook.main[2]: Refreshing state... [id=294754360]
module.BERTRANDVincent.github_membership.main: Refreshing state... [id=eleven-labs:Vubs]
module.DURANDRomain.github_membership.main: Refreshing state... [id=eleven-labs:romaindurand]
module.CALONEBastien.github_membership.main: Refreshing state... [id=eleven-labs:BastienCalone]
module.BERNARDJeremy.github_membership.main: Refreshing state... [id=eleven-labs:BernardJeremy]
module.RAMEAUBenoit.github_membership.main: Refreshing state... [id=eleven-labs:captain-Krook]
module.JACQUEMINArthur.github_membership.main: Refreshing state... [id=eleven-labs:ArthurJCQ]
module.AMARBenjamin.github_membership.main: Refreshing state... [id=eleven-labs:BenAmarEleven]
module.FERTDimitri.github_membership.main: Refreshing state... [id=eleven-labs:dimitri-fert]
module.MOUTTEAnthony.github_membership.main: Refreshing state... [id=eleven-labs:instabledesign]
module.HUCHONThibaud.github_membership.main: Refreshing state... [id=eleven-labs:ettibo]
module.COURBORenaud.github_membership.main: Refreshing state... [id=eleven-labs:rcourbo87]
module.LENGLETMartin.github_membership.main: Refreshing state... [id=eleven-labs:ulrik59]
module.ALLIERAlexandre.github_membership.main: Refreshing state... [id=eleven-labs:aallier]
module.KANIANoel.github_membership.main: Refreshing state... [id=eleven-labs:snroki]
module.ELFARSAOUIKamal.github_membership.main: Refreshing state... [id=eleven-labs:elfakamal]
module.GRAILLONRobin.github_membership.main: Refreshing state... [id=eleven-labs:graillus]
module.LANAUGregory.github_membership.main: Refreshing state... [id=eleven-labs:glanau]
module.PASQUETFabien.github_membership.main: Refreshing state... [id=eleven-labs:fpasquet]
module.MAVILLAZRemi.github_membership.main: Refreshing state... [id=eleven-labs:KizeRemi]
module.SAILLARDDamien11.github_membership.main: Refreshing state... [id=eleven-labs:dsaillard-eleven-labs]
module.EINHORNStephane.github_membership.main: Refreshing state... [id=eleven-labs:seinhorn]
module.PEAUDECERFMarion.github_membership.main: Refreshing state... [id=eleven-labs:MarionPdcf]
module.DUNGKevin.github_membership.main: Refreshing state... [id=eleven-labs:KevinDung]
module.WILSON.github_membership.main: Refreshing state... [id=eleven-labs:ElevenWilson]
module.OGRENCarl.github_membership.main: Refreshing state... [id=eleven-labs:RasCarlito]
module.MINASYANMarie.github_membership.main: Refreshing state... [id=eleven-labs:MarieMinasyan]
module.VEBERArnaud.github_membership.main: Refreshing state... [id=eleven-labs:VEBERArnaud]
module.BESSOUDOSebastien.github_membership.main: Refreshing state... [id=eleven-labs:Sbessoudo]
module.MIGEOTDEBARANFabrice.github_membership.main: Refreshing state... [id=eleven-labs:nmss]
module.MOATIJacques.github_membership.main: Refreshing state... [id=eleven-labs:Jmoati]
module.BRENOTPierre.github_membership.main: Refreshing state... [id=eleven-labs:flipper-ananas]
module.JARDINETRemy.github_membership.main: Refreshing state... [id=eleven-labs:Pouzor]
module.BOILLONYannick.github_membership.main: Refreshing state... [id=eleven-labs:yannickBoillon]
module.GREVINNicolas.github_membership.main: Refreshing state... [id=eleven-labs:nicolas-grevin]
module.FRUITDimitri.github_membership.main: Refreshing state... [id=eleven-labs:DimitriMorgan]
module.SOLOMONEmmanuel.github_membership.main: Refreshing state... [id=eleven-labs:manuEleven]
module.JOSEPHMarianne.github_membership.main: Refreshing state... [id=eleven-labs:ElevenMarianne]
module.BRUGIDOUThibaut.github_membership.main: Refreshing state... [id=eleven-labs:Thibaut-Brugidou]
module.ANDREAlexandre.github_membership.main: Refreshing state... [id=eleven-labs:alex-ception]
module.BERRYElsa.github_membership.main: Refreshing state... [id=eleven-labs:ElsaEleven]
module.PEJOUTThomas.github_membership.main: Refreshing state... [id=eleven-labs:ElevenTom]
module.CLAVIERAnais.github_membership.main: Refreshing state... [id=eleven-labs:Anacla]
module.CHARRONMaeva.github_membership.main: Refreshing state... [id=eleven-labs:mcharron11labs]
module.GORRONCharlesEric.github_membership.main: Refreshing state... [id=eleven-labs:ch3ric]
module.NICOLAIEAlexandre.github_membership.main: Refreshing state... [id=eleven-labs:xunleii]
module.wheel-of-fortune.github_issue_label.main[9]: Refreshing state... [id=wheel-of-fortune:type/test]
module.wheel-of-fortune.github_issue_label.main[8]: Refreshing state... [id=wheel-of-fortune:type/refactor]
module.wheel-of-fortune.github_issue_label.main[6]: Refreshing state... [id=wheel-of-fortune:type/fix]
module.wheel-of-fortune.github_issue_label.main[0]: Refreshing state... [id=wheel-of-fortune:status/depend]
module.wheel-of-fortune.github_issue_label.main[2]: Refreshing state... [id=wheel-of-fortune:status/reviewable]
module.wheel-of-fortune.github_issue_label.main[3]: Refreshing state... [id=wheel-of-fortune:status/wip]
module.wheel-of-fortune.github_issue_label.main[7]: Refreshing state... [id=wheel-of-fortune:type/question]
module.wheel-of-fortune.github_issue_label.main[4]: Refreshing state... [id=wheel-of-fortune:type/chore]
module.wheel-of-fortune.github_issue_label.main[1]: Refreshing state... [id=wheel-of-fortune:status/mergeable]
module.wheel-of-fortune.github_issue_label.main[5]: Refreshing state... [id=wheel-of-fortune:type/feat]
module.SURPierre.github_membership.main: Refreshing state... [id=eleven-labs:psur-eleven]
module.jekyll-multiple-languages-plugin.github_issue_label.main[7]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/question]
module.jekyll-multiple-languages-plugin.github_issue_label.main[2]: Refreshing state... [id=jekyll-multiple-languages-plugin:status/reviewable]
module.jekyll-multiple-languages-plugin.github_issue_label.main[8]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/refactor]
module.jekyll-multiple-languages-plugin.github_issue_label.main[0]: Refreshing state... [id=jekyll-multiple-languages-plugin:status/depend]
module.jekyll-multiple-languages-plugin.github_issue_label.main[4]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/chore]
module.jekyll-multiple-languages-plugin.github_issue_label.main[6]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/fix]
module.jekyll-multiple-languages-plugin.github_issue_label.main[1]: Refreshing state... [id=jekyll-multiple-languages-plugin:status/mergeable]
module.jekyll-multiple-languages-plugin.github_issue_label.main[3]: Refreshing state... [id=jekyll-multiple-languages-plugin:status/wip]
module.jekyll-multiple-languages-plugin.github_issue_label.main[5]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/feat]
module.jekyll-multiple-languages-plugin.github_issue_label.main[9]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/test]
module.DELPEYROUXVictor.github_membership.main: Refreshing state... [id=eleven-labs:Vik-Th0r]
module.codelabs.github_repository_webhook.main[1]: Refreshing state... [id=253136607]
module.codelabs.github_repository_webhook.main[0]: Refreshing state... [id=77131724]
module.codelabs.github_issue_label.main[9]: Refreshing state... [id=codelabs:type/test]
module.codelabs.github_issue_label.main[3]: Refreshing state... [id=codelabs:status/wip]
module.codelabs.github_issue_label.main[2]: Refreshing state... [id=codelabs:status/reviewable]
module.codelabs.github_issue_label.main[6]: Refreshing state... [id=codelabs:type/fix]
module.codelabs.github_issue_label.main[5]: Refreshing state... [id=codelabs:type/feat]
module.codelabs.github_issue_label.main[8]: Refreshing state... [id=codelabs:type/refactor]
module.codelabs.github_issue_label.main[4]: Refreshing state... [id=codelabs:type/chore]
module.codelabs.github_issue_label.main[0]: Refreshing state... [id=codelabs:status/depend]
module.codelabs.github_issue_label.main[1]: Refreshing state... [id=codelabs:status/mergeable]
module.codelabs.github_issue_label.main[7]: Refreshing state... [id=codelabs:type/question]
module.CANALGuillem.github_membership.main: Refreshing state... [id=eleven-labs:guillemcanal]
module.FEIREISENBenjamin.github_membership.main: Refreshing state... [id=eleven-labs:bfeir-eleven]
module.blog_eleven-labs_com.github_issue_label.main[1]: Refreshing state... [id=blog.eleven-labs.com:status/mergeable]
module.blog_eleven-labs_com.github_issue_label.main[9]: Refreshing state... [id=blog.eleven-labs.com:type/test]
module.blog_eleven-labs_com.github_issue_label.main[5]: Refreshing state... [id=blog.eleven-labs.com:type/feat]
module.blog_eleven-labs_com.github_issue_label.main[4]: Refreshing state... [id=blog.eleven-labs.com:type/chore]
module.blog_eleven-labs_com.github_issue_label.main[6]: Refreshing state... [id=blog.eleven-labs.com:type/fix]
module.blog_eleven-labs_com.github_issue_label.main[2]: Refreshing state... [id=blog.eleven-labs.com:status/reviewable]
module.blog_eleven-labs_com.github_issue_label.main[3]: Refreshing state... [id=blog.eleven-labs.com:status/wip]
module.blog_eleven-labs_com.github_issue_label.main[8]: Refreshing state... [id=blog.eleven-labs.com:type/refactor]
module.blog_eleven-labs_com.github_issue_label.main[0]: Refreshing state... [id=blog.eleven-labs.com:status/depend]
module.blog_eleven-labs_com.github_issue_label.main[7]: Refreshing state... [id=blog.eleven-labs.com:type/question]
module.THUONThierry.github_membership.main: Refreshing state... [id=eleven-labs:lepiaf]
module.CADOUXMartin.github_membership.main: Refreshing state... [id=eleven-labs:martincadoux]
module.LEROUGEPierre.github_membership.main: Refreshing state... [id=eleven-labs:RedPi]
module.CORDIERKevin.github_membership.main: Refreshing state... [id=eleven-labs:frisoty]
module.BETHMONTThomas.github_membership.main: Refreshing state... [id=eleven-labs:thomasbethmont]
module.KONTOMARKOSSophie.github_membership.main: Refreshing state... [id=eleven-labs:breizh81]
module.DIOURIYounes.github_membership.main: Refreshing state... [id=eleven-labs:younesdiouri]
module.PIERLOTRomain.github_membership.main: Refreshing state... [id=eleven-labs:rpierlot]
module.SAILLARDDamien.github_membership.main: Refreshing state... [id=eleven-labs:daemon1981]
module.codelabs.github_branch_protection.main[0]: Refreshing state... [id=codelabs:master]
module.blog_eleven-labs_com.github_branch_protection.main[0]: Refreshing state... [id=blog.eleven-labs.com:master]
module.hq.github_team_membership.members["ElsaEleven"]: Refreshing state... [id=2362575:ElsaEleven]
module.hq.github_team_membership.members["Anacla"]: Refreshing state... [id=2362575:Anacla]
module.hq.github_team_membership.members["BenAmarEleven"]: Refreshing state... [id=2362575:BenAmarEleven]
module.hq.github_team_membership.members["ElevenTom"]: Refreshing state... [id=2362575:ElevenTom]
module.hq.github_team_membership.members["ElevenWilson"]: Refreshing state... [id=2362575:ElevenWilson]
module.developers.github_team_repository.repositories["blog.eleven-labs.com"]: Refreshing state... [id=642624:blog.eleven-labs.com]
module.developers.github_team_repository.repositories["nebula-react"]: Refreshing state... [id=642624:nebula-react]
module.developers.github_team_repository.repositories["codelabs"]: Refreshing state... [id=642624:codelabs]
module.developers.github_team_repository.repositories["jekyll-multiple-languages-plugin"]: Refreshing state... [id=642624:jekyll-multiple-languages-plugin]
module.developers.github_team_repository.repositories["github"]: Refreshing state... [id=642624:github]
module.developers.github_team_repository.repositories["wheel-of-fortune"]: Refreshing state... [id=642624:wheel-of-fortune]
module.developers.github_team_repository.repositories["black-hole"]: Refreshing state... [id=642624:black-hole]
module.developers.github_team_repository.repositories["amp-jekyll"]: Refreshing state... [id=642624:amp-jekyll]
module.developers.github_team_repository.repositories["api-validator"]: Refreshing state... [id=642624:api-validator]
module.core.github_team_repository.repositories["nebula-react"]: Refreshing state... [id=540795:nebula-react]
module.core.github_team_repository.repositories["black-hole"]: Refreshing state... [id=540795:black-hole]
module.core.github_team_repository.repositories["codelabs"]: Refreshing state... [id=540795:codelabs]
module.core.github_team_repository.repositories["amp-jekyll"]: Refreshing state... [id=540795:amp-jekyll]
module.core.github_team_repository.repositories["jekyll-multiple-languages-plugin"]: Refreshing state... [id=540795:jekyll-multiple-languages-plugin]
module.core.github_team_repository.repositories["wheel-of-fortune"]: Refreshing state... [id=540795:wheel-of-fortune]
module.core.github_team_repository.repositories["api-validator"]: Refreshing state... [id=540795:api-validator]
module.core.github_team_repository.repositories["blog.eleven-labs.com"]: Refreshing state... [id=540795:blog.eleven-labs.com]
module.core.github_team_repository.repositories["github"]: Refreshing state... [id=540795:github]
module.hq.github_team_repository.repositories["amp-jekyll"]: Refreshing state... [id=2362575:amp-jekyll]
module.hq.github_team_repository.repositories["black-hole"]: Refreshing state... [id=2362575:black-hole]
module.hq.github_team_repository.repositories["github"]: Refreshing state... [id=2362575:github]
module.hq.github_team_repository.repositories["blog.eleven-labs.com"]: Refreshing state... [id=2362575:blog.eleven-labs.com]
module.hq.github_team_repository.repositories["wheel-of-fortune"]: Refreshing state... [id=2362575:wheel-of-fortune]
module.hq.github_team_repository.repositories["codelabs"]: Refreshing state... [id=2362575:codelabs]
module.hq.github_team_repository.repositories["nebula-react"]: Refreshing state... [id=2362575:nebula-react]
module.hq.github_team_repository.repositories["api-validator"]: Refreshing state... [id=2362575:api-validator]
module.hq.github_team_repository.repositories["jekyll-multiple-languages-plugin"]: Refreshing state... [id=2362575:jekyll-multiple-languages-plugin]
module.core.github_team_membership.members["graillus"]: Refreshing state... [id=540795:graillus]
module.core.github_team_membership.members["snroki"]: Refreshing state... [id=540795:snroki]
module.core.github_team_membership.members["Pouzor"]: Refreshing state... [id=540795:Pouzor]
module.core.github_team_membership.members["VEBERArnaud"]: Refreshing state... [id=540795:VEBERArnaud]
module.core.github_team_membership.members["ch3ric"]: Refreshing state... [id=540795:ch3ric]
module.core.github_team_membership.members["daemon1981"]: Refreshing state... [id=540795:daemon1981]
module.core.github_team_membership.members["dsaillard-eleven-labs"]: Refreshing state... [id=540795:dsaillard-eleven-labs]
module.developers.github_team_membership.members["flipper-ananas"]: Refreshing state... [id=642624:flipper-ananas]
module.developers.github_team_membership.members["Sbessoudo"]: Refreshing state... [id=642624:Sbessoudo]
module.developers.github_team_membership.members["Thibaut-Brugidou"]: Refreshing state... [id=642624:Thibaut-Brugidou]
module.developers.github_team_membership.members["Anacla"]: Refreshing state... [id=642624:Anacla]
module.developers.github_team_membership.members["ArthurJCQ"]: Refreshing state... [id=642624:ArthurJCQ]
module.developers.github_team_membership.members["Vik-Th0r"]: Refreshing state... [id=642624:Vik-Th0r]
module.developers.github_team_membership.members["MarionPdcf"]: Refreshing state... [id=642624:MarionPdcf]
module.developers.github_team_membership.members["VEBERArnaud"]: Refreshing state... [id=642624:VEBERArnaud]
module.developers.github_team_membership.members["psur-eleven"]: Refreshing state... [id=642624:psur-eleven]
module.developers.github_team_membership.members["nicolas-grevin"]: Refreshing state... [id=642624:nicolas-grevin]
module.developers.github_team_membership.members["alex-ception"]: Refreshing state... [id=642624:alex-ception]
module.developers.github_team_membership.members["daemon1981"]: Refreshing state... [id=642624:daemon1981]
module.developers.github_team_membership.members["dimitri-fert"]: Refreshing state... [id=642624:dimitri-fert]
module.developers.github_team_membership.members["martincadoux"]: Refreshing state... [id=642624:martincadoux]
module.developers.github_team_membership.members["glanau"]: Refreshing state... [id=642624:glanau]
module.developers.github_team_membership.members["RasCarlito"]: Refreshing state... [id=642624:RasCarlito]
module.developers.github_team_membership.members["guillemcanal"]: Refreshing state... [id=642624:guillemcanal]
module.developers.github_team_membership.members["nmss"]: Refreshing state... [id=642624:nmss]
module.developers.github_team_membership.members["frisoty"]: Refreshing state... [id=642624:frisoty]
module.developers.github_team_membership.members["ch3ric"]: Refreshing state... [id=642624:ch3ric]
module.developers.github_team_membership.members["elfakamal"]: Refreshing state... [id=642624:elfakamal]
module.developers.github_team_membership.members["Jmoati"]: Refreshing state... [id=642624:Jmoati]
module.developers.github_team_membership.members["ElevenMarianne"]: Refreshing state... [id=642624:ElevenMarianne]
module.developers.github_team_membership.members["breizh81"]: Refreshing state... [id=642624:breizh81]
module.developers.github_team_membership.members["Pouzor"]: Refreshing state... [id=642624:Pouzor]
module.developers.github_team_membership.members["rcourbo87"]: Refreshing state... [id=642624:rcourbo87]
module.developers.github_team_membership.members["thomasbethmont"]: Refreshing state... [id=642624:thomasbethmont]
module.developers.github_team_membership.members["yannickBoillon"]: Refreshing state... [id=642624:yannickBoillon]
module.developers.github_team_membership.members["seinhorn"]: Refreshing state... [id=642624:seinhorn]
module.developers.github_team_membership.members["DimitriMorgan"]: Refreshing state... [id=642624:DimitriMorgan]
module.developers.github_team_membership.members["ulrik59"]: Refreshing state... [id=642624:ulrik59]
module.developers.github_team_membership.members["aallier"]: Refreshing state... [id=642624:aallier]
module.developers.github_team_membership.members["mcharron11labs"]: Refreshing state... [id=642624:mcharron11labs]
module.developers.github_team_membership.members["dsaillard-eleven-labs"]: Refreshing state... [id=642624:dsaillard-eleven-labs]
module.developers.github_team_membership.members["Vubs"]: Refreshing state... [id=642624:Vubs]
module.developers.github_team_membership.members["lepiaf"]: Refreshing state... [id=642624:lepiaf]
module.developers.github_team_membership.members["fpasquet"]: Refreshing state... [id=642624:fpasquet]
module.developers.github_team_membership.members["bfeir-eleven"]: Refreshing state... [id=642624:bfeir-eleven]
module.developers.github_team_membership.members["RedPi"]: Refreshing state... [id=642624:RedPi]
module.developers.github_team_membership.members["BernardJeremy"]: Refreshing state... [id=642624:BernardJeremy]
module.developers.github_team_membership.members["manuEleven"]: Refreshing state... [id=642624:manuEleven]
module.developers.github_team_membership.members["captain-Krook"]: Refreshing state... [id=642624:captain-Krook]
module.developers.github_team_membership.members["KizeRemi"]: Refreshing state... [id=642624:KizeRemi]
module.developers.github_team_membership.members["rpierlot"]: Refreshing state... [id=642624:rpierlot]
module.developers.github_team_membership.members["romaindurand"]: Refreshing state... [id=642624:romaindurand]
module.developers.github_team_membership.members["younesdiouri"]: Refreshing state... [id=642624:younesdiouri]
module.developers.github_team_membership.members["instabledesign"]: Refreshing state... [id=642624:instabledesign]
module.developers.github_team_membership.members["BastienCalone"]: Refreshing state... [id=642624:BastienCalone]
module.developers.github_team_membership.members["MarieMinasyan"]: Refreshing state... [id=642624:MarieMinasyan]
module.developers.github_team_membership.members["snroki"]: Refreshing state... [id=642624:snroki]
module.developers.github_team_membership.members["ettibo"]: Refreshing state... [id=642624:ettibo]
module.developers.github_team_membership.members["xunleii"]: Refreshing state... [id=642624:xunleii]
module.developers.github_team_membership.members["KevinDung"]: Refreshing state... [id=642624:KevinDung]
module.developers.github_team_membership.members["graillus"]: Refreshing state... [id=642624:graillus]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.core.github_team_repository.repositories["eleven-labs.com"] will be created
  + resource "github_team_repository" "repositories" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "eleven-labs.com"
      + team_id    = "540795"
    }

  # module.developers.github_team_repository.repositories["eleven-labs.com"] will be created
  + resource "github_team_repository" "repositories" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "eleven-labs.com"
      + team_id    = "642624"
    }

  # module.eleven-labs_com.github_issue_label.main[0] will be created
  + resource "github_issue_label" "main" {
      + color       = "d93f0b"
      + description = "status: depend"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "status/depend"
      + repository  = "eleven-labs.com"
      + url         = (known after apply)
    }

  # module.eleven-labs_com.github_issue_label.main[1] will be created
  + resource "github_issue_label" "main" {
      + color       = "009800"
      + description = "status: mergeable"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "status/mergeable"
      + repository  = "eleven-labs.com"
      + url         = (known after apply)
    }

  # module.eleven-labs_com.github_issue_label.main[2] will be created
  + resource "github_issue_label" "main" {
      + color       = "1d76db"
      + description = "status: reviewable"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "status/reviewable"
      + repository  = "eleven-labs.com"
      + url         = (known after apply)
    }

  # module.eleven-labs_com.github_issue_label.main[3] will be created
  + resource "github_issue_label" "main" {
      + color       = "ffdd88"
      + description = "status: wip"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "status/wip"
      + repository  = "eleven-labs.com"
      + url         = (known after apply)
    }

  # module.eleven-labs_com.github_issue_label.main[4] will be created
  + resource "github_issue_label" "main" {
      + color       = "84b6eb"
      + description = "type: chore"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "type/chore"
      + repository  = "eleven-labs.com"
      + url         = (known after apply)
    }

  # module.eleven-labs_com.github_issue_label.main[5] will be created
  + resource "github_issue_label" "main" {
      + color       = "1abc9c"
      + description = "type: feat"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "type/feat"
      + repository  = "eleven-labs.com"
      + url         = (known after apply)
    }

  # module.eleven-labs_com.github_issue_label.main[6] will be created
  + resource "github_issue_label" "main" {
      + color       = "fbca04"
      + description = "type: fix"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "type/fix"
      + repository  = "eleven-labs.com"
      + url         = (known after apply)
    }

  # module.eleven-labs_com.github_issue_label.main[7] will be created
  + resource "github_issue_label" "main" {
      + color       = "c7def8"
      + description = "type: question"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "type/question"
      + repository  = "eleven-labs.com"
      + url         = (known after apply)
    }

  # module.eleven-labs_com.github_issue_label.main[8] will be created
  + resource "github_issue_label" "main" {
      + color       = "5319e7"
      + description = "type: refactor"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "type/refactor"
      + repository  = "eleven-labs.com"
      + url         = (known after apply)
    }

  # module.eleven-labs_com.github_issue_label.main[9] will be created
  + resource "github_issue_label" "main" {
      + color       = "cccccc"
      + description = "type: test"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "type/test"
      + repository  = "eleven-labs.com"
      + url         = (known after apply)
    }

  # module.eleven-labs_com.github_repository.main will be created
  + resource "github_repository" "main" {
      + allow_merge_commit = true
      + allow_rebase_merge = true
      + allow_squash_merge = true
      + archived           = false
      + auto_init          = false
      + default_branch     = (known after apply)
      + description        = "https://eleven-labs.com website"
      + etag               = (known after apply)
      + full_name          = (known after apply)
      + git_clone_url      = (known after apply)
      + has_downloads      = true
      + has_issues         = true
      + has_projects       = true
      + has_wiki           = true
      + homepage_url       = "https://eleven-labs.com"
      + html_url           = (known after apply)
      + http_clone_url     = (known after apply)
      + id                 = (known after apply)
      + name               = "eleven-labs.com"
      + private            = true
      + ssh_clone_url      = (known after apply)
      + svn_url            = (known after apply)
    }

  # module.hq.github_team_repository.repositories["eleven-labs.com"] will be created
  + resource "github_team_repository" "repositories" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "eleven-labs.com"
      + team_id    = "2362575"
    }

Plan: 14 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @VEBERArnaud, Action: `pull_request`, Workflow: `terraform`*